knieriem/tinygo-stm32-svd/svd/stm32h745cm4.svd
        <register>
          <name>RST1R</name>
          <displayName>RSTA1R</displayName>
          <description>Timerx Output1 Reset Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UPDATE</name>
              <description>UPDATE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>UPDATE</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Register update event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetInactive</name>
                  <description>Register update event forces the output to its inactive state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>10</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-10</dimIndex>
              <name>EXTEVNT%s</name>
              <description>EXTEVNT%s</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EXTEVNT1</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>External event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetInactive</name>
                  <description>External event forces the output to its inactive state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMBCMP1</name>
              <description>Timer B Compare 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TIMBCMP1</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Timer event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetInactive</name>
                  <description>Timer event forces the output to its inactive state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMECMP4</name>
              <description>Timer E Compare 4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMECMP3</name>
              <description>Timer E Compare 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMDCMP2</name>
              <description>Timer D Compare 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMDCMP1</name>
              <description>Timer D Compare 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMCCMP3</name>
              <description>Timer C Compare 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMCCMP2</name>
              <description>Timer C Compare 2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMBCMP4</name>
              <description>Timer B Compare 4</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <name>TIMBCMP2</name>
              <description>Timer B Compare 2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TIMBCMP1"/>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>MSTCMP%s</name>
              <description>MSTCMP%s</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MSTCMP1</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Master timer compare event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetInactive</name>
                  <description>Master timer compare event forces the output to its inactive state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSTPER</name>
              <description>MSTPER</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MSTPER</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Master timer counter roll-over/reset has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetInactive</name>
                  <description>Master timer counter roll-over/reset forces the output to its inactive state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>CMP%s</name>
              <description>CMP%s</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CMP1</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Timer compare event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetInactive</name>
                  <description>Timer compare event forces the output to its inactive state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER</name>
              <description>PER</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PER</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Timer period event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetInactive</name>
                  <description>Timer period event forces the output to its inactive state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESYNC</name>
              <description>RESYNC</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RESYNC</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Timer reset event coming solely from software or SYNC input event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetInactive</name>
                  <description>Timer reset event coming solely from software or SYNC input event forces the output to its inactive state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRT</name>
              <description>SRT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SRT</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetInactive</name>
                  <description>Force output to its inactive state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register derivedFrom="SET1R">
          <name>SET2R</name>
          <displayName>SETA2R</displayName>
          <description>Timerx Output2 Set Register</description>
          <addressOffset>0x44</addressOffset>
        </register>
