knieriem/tinygo-stm32-svd/svd/stm32h745cm4.svd
        <register derivedFrom="CPT1CR">
          <name>CPT2CR</name>
          <displayName>CPT2ACR</displayName>
          <description>CPT2xCR</description>
          <addressOffset>0x60</addressOffset>
        </register>
        <register>
          <name>OUTR</name>
          <displayName>OUTAR</displayName>
          <description>Timerx Output Register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIDL1</name>
              <description>Output 1 Deadtime upon burst mode Idle
              entry</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DIDL1</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The programmed idle state is applied immediately to the output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Deadtime (inactive level) is inserted on output before entering the idle mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIDL2</name>
              <description>Output 2 Deadtime upon burst mode Idle
              entry</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DIDL1"/>
            </field>
            <field>
              <name>CHP1</name>
              <description>Output 1 Chopper enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CHP1</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output signal not altered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Output signal is chopped by a carrier signal</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHP2</name>
              <description>Output 2 Chopper enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="CHP1"/>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Output 1 Fault state</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>FAULT1</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No action: the output is not affected by the fault input and stays in run mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetActive</name>
                  <description>Output goes to active state after a fault event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetInactive</name>
                  <description>Output goes to inactive state after a fault event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetHighZ</name>
                  <description>Output goes to high-z state after a fault event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAULT2</name>
              <description>Output 2 Fault state</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="FAULT1"/>
            </field>
            <field>
              <name>IDLES1</name>
              <description>Output 1 Idle State</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>IDLES1</name>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Output idle state is inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Output idle state is active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLES2</name>
              <description>Output 2 Idle State</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="IDLES1"/>
            </field>
            <field>
              <name>IDLEM1</name>
              <description>Output 1 Idle mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>IDLEM1</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>No action: the output is not affected by the burst mode operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SetIdle</name>
                  <description>The output is in idle state when requested by the burst mode controller</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLEM2</name>
              <description>Output 2 Idle mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="IDLEM1"/>
            </field>
            <field>
              <name>POL1</name>
              <description>Output 1 polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>POL1</name>
                <enumeratedValue>
                  <name>ActiveHigh</name>
                  <description>Positive polarity (output active high)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ActiveLow</name>
                  <description>Negative polarity (output active low)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POL2</name>
              <description>Output 2 polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="POL1"/>
            </field>
            <field>
              <name>DLYPRT</name>
              <description>Delayed Protection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>DLYPRT</name>
                <enumeratedValue>
                  <name>Output1_EE6</name>
                  <description>Output 1 delayed idle on external event 6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output2_EE6</name>
                  <description>Output 2 delayed idle on external event 6</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output1_2_EE6</name>
                  <description>Output 1 and 2 delayed idle on external event 6</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Balanced_EE6</name>
                  <description>Balanced idle on external event 6</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output1_EE7</name>
                  <description>Output 1 delayed idle on external event 7</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output2_EE7</name>
                  <description>Output 2 delayed idle on external event 7</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output1_2_EE7</name>
                  <description>Output 1 and 2 delayed idle on external event 7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Balanced_EE7</name>
                  <description>Balanced idle on external event 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLYPRTEN</name>
              <description>Delayed Protection Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DLYPRTEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Delayed protection is enabled, as per DLYPRT bits</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTEN</name>
              <description>Deadtime enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DTEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Output 1 and 2 signals are independent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Deadtime is inserted between output 1 and output 2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLTR</name>
          <displayName>FLTAR</displayName>
          <description>Timerx Fault Register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FLTLCK</name>
              <description>Fault sources Lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FLTLCK</name>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>FLT1EN..FLT5EN bits are read/write</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>FLT1EN..FLT5EN bits are read only</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-5</dimIndex>
              <name>FLT%sEN</name>
              <description>Fault %s enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FLT1EN</name>
                <enumeratedValue>
                  <name>Ignored</name>
                  <description>Fault input ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Fault input is active and can disable HRTIM outputs</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
