knieriem/tinygo-stm32-svd/svd/stm32h745cm4.svd
        <register derivedFrom="HRTIM_TIMA.ICR">
          <name>ICR</name>
          <displayName>CICR</displayName>
          <description>Timerx Interrupt Clear
          Register</description>
          <addressOffset>0x8</addressOffset>
        </register>
        <register derivedFrom="HRTIM_TIMA.DIER">
          <name>DIER</name>
          <displayName>CDIER5</displayName>
          <description>TIMxDIER5</description>
          <addressOffset>0xC</addressOffset>
        </register>
        <register derivedFrom="HRTIM_Master.CNTR">
          <name>CNTR</name>
          <displayName>CNTCR</displayName>
          <description>Timerx Counter Register</description>
          <addressOffset>0x10</addressOffset>
        </register>
        <register derivedFrom="HRTIM_Master.PERR">
          <name>PERR</name>
          <displayName>PERCR</displayName>
          <description>Timerx Period Register</description>
          <addressOffset>0x14</addressOffset>
        </register>
        <register derivedFrom="HRTIM_Master.REPR">
          <name>REPR</name>
          <displayName>REPCR</displayName>
          <description>Timerx Repetition Register</description>
          <addressOffset>0x18</addressOffset>
        </register>
        <register derivedFrom="HRTIM_Master.CMP1R">
          <name>CMP1R</name>
          <displayName>CMP1CR</displayName>
          <description>Timerx Compare 1 Register</description>
          <addressOffset>0x1C</addressOffset>
        </register>
        <register derivedFrom="HRTIM_TIMA.CMP1CR">
          <name>CMP1CR</name>
          <displayName>CMP1CCR</displayName>
          <description>Timerx Compare 1 Compound
          Register</description>
          <addressOffset>0x20</addressOffset>
        </register>
        <register derivedFrom="CMP1R">
          <name>CMP2R</name>
          <displayName>CMP2CR</displayName>
          <description>Timerx Compare 2 Register</description>
          <addressOffset>0x24</addressOffset>
        </register>
        <register derivedFrom="CMP1R">
          <name>CMP3R</name>
          <displayName>CMP3CR</displayName>
          <description>Timerx Compare 3 Register</description>
          <addressOffset>0x28</addressOffset>
        </register>
        <register derivedFrom="CMP1R">
          <name>CMP4R</name>
          <displayName>CMP4CR</displayName>
          <description>Timerx Compare 4 Register</description>
          <addressOffset>0x2C</addressOffset>
        </register>
        <register derivedFrom="HRTIM_TIMA.CPT1R">
          <name>CPT1R</name>
          <displayName>CPT1CR</displayName>
          <description>Timerx Capture 1 Register</description>
          <addressOffset>0x30</addressOffset>
        </register>
        <register derivedFrom="HRTIM_TIMA.CPT1R">
          <name>CPT2R</name>
          <displayName>CPT2CR</displayName>
          <description>Timerx Capture 2 Register</description>
          <addressOffset>0x34</addressOffset>
        </register>
        <register derivedFrom="HRTIM_TIMA.DTR">
          <name>DTR</name>
          <displayName>DTCR</displayName>
          <description>Timerx Deadtime Register</description>
          <addressOffset>0x38</addressOffset>
        </register>
        <register>
          <name>SET1R</name>
          <displayName>SETC1R</displayName>
          <description>Timerx Output1 Set Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field derivedFrom="HRTIM_TIMA.SET1R.UPDATE">
              <name>UPDATE</name>
              <description>Registers update (transfer preload to
              active)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.EXTEVNT%s">
              <dim>10</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-10</dimIndex>
              <name>EXTEVNT%s</name>
              <description>External Event %s</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.TIMBCMP1">
              <name>TIMACMP2</name>
              <description>Timer A Compare 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.TIMBCMP1">
              <name>TIMECMP4</name>
              <description>Timer E Compare 4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.TIMBCMP1">
              <name>TIMECMP3</name>
              <description>Timer E Compare 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.TIMBCMP1">
              <name>TIMECMP2</name>
              <description>Timer E Compare 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.TIMBCMP1">
              <name>TIMDCMP4</name>
              <description>Timer D Compare 4</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.TIMBCMP1">
              <name>TIMDCMP2</name>
              <description>Timer D Compare 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.TIMBCMP1">
              <name>TIMBCMP3</name>
              <description>Timer B Compare 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.TIMBCMP1">
              <name>TIMBCMP2</name>
              <description>Timer B Compare 2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.TIMBCMP1">
              <name>TIMACMP3</name>
              <description>Timer A Compare 3</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.MSTCMP%s">
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>MSTCMP%s</name>
              <description>Master Compare %s</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.MSTPER">
              <name>MSTPER</name>
              <description>Master Period</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.CMP%s">
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>CMP%s</name>
              <description>Timer A compare %s</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.PER">
              <name>PER</name>
              <description>Timer A Period</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.RESYNC">
              <name>RESYNC</name>
              <description>Timer A resynchronizaton</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.SET1R.SST">
              <name>SST</name>
              <description>Software Set trigger</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RST1R</name>
          <displayName>RSTC1R</displayName>
          <description>Timerx Output1 Reset Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field derivedFrom="HRTIM_TIMA.RST1R.UPDATE">
              <name>UPDATE</name>
              <description>UPDATE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.EXTEVNT%s">
              <dim>10</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-10</dimIndex>
              <name>EXTEVNT%s</name>
              <description>EXTEVNT%s</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.TIMBCMP1">
              <name>TIMACMP2</name>
              <description>Timer A Compare 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.TIMBCMP1">
              <name>TIMECMP4</name>
              <description>Timer E Compare 4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.TIMBCMP1">
              <name>TIMECMP3</name>
              <description>Timer E Compare 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.TIMBCMP1">
              <name>TIMECMP2</name>
              <description>Timer E Compare 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.TIMBCMP1">
              <name>TIMDCMP4</name>
              <description>Timer D Compare 4</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.TIMBCMP1">
              <name>TIMDCMP2</name>
              <description>Timer D Compare 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.TIMBCMP1">
              <name>TIMBCMP3</name>
              <description>Timer B Compare 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.TIMBCMP1">
              <name>TIMBCMP2</name>
              <description>Timer B Compare 2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.TIMBCMP1">
              <name>TIMACMP3</name>
              <description>Timer A Compare 3</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.MSTCMP%s">
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>MSTCMP%s</name>
              <description>MSTCMP%s</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.MSTPER">
              <name>MSTPER</name>
              <description>MSTPER</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.CMP%s">
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>CMP%s</name>
              <description>CMP%s</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.PER">
              <name>PER</name>
              <description>PER</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.RESYNC">
              <name>RESYNC</name>
              <description>RESYNC</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.RST1R.SRT">
              <name>SRT</name>
              <description>SRT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register derivedFrom="SET1R">
          <name>SET2R</name>
          <displayName>SETC2R</displayName>
          <description>Timerx Output2 Set Register</description>
          <addressOffset>0x44</addressOffset>
        </register>
